# Программа "Калькулятор"
# Выполняет операции +, -, *, /
print("Программа калькулятор")
a = float(input("Введите первое число a= "))
b = float(input("Введите второе число b= "))
c = input("Ведите операцию +, -, *, / :")
if c in ['+', '-', '*', '/']:
        if c == '+':
            print(f"Результат: {a+b}")
        elif c == '-':
            print(f"Результат: {a-b}")
        elif c == '*':
            print(f"Результат: {a*b}")
        elif c == '/':
            if b != 0:
                print(f"Результат: {a/b}")
            else:
                print("Деление на ноль!")
else:
        print("Не введен знак +,-,*,/: ")
